{"keras_version": "2.1.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [6, 6], "batch_input_shape": [null, 1, 48, 96], "filters": 13, "name": "conv2d_1", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "filters": 13, "name": "conv2d_2", "bias_constraint": null, "padding": "valid", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_size": [6, 6], "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1012, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 506, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}]}